rhosync-api/store-rails/app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "brand", "price", "created_at", "quantity", "updated_at", "sku") VALUES('iPhone', 'Apple', '$199.99', '2010-07-23 00:57:23', '2', '2010-07-23 00:57:23', '12345')

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT * FROM "products" WHERE ("products"."id" = 8)
UPDATE "products" SET "updated_at" = '2010-07-23 05:46:26', "name" = 'iphone 4', "price" = '$299.99' WHERE "id" = 13